vim.org
#+INCLUDE: ./main.setup
#+TITLE: vim
#+AUTHOR: Dongsoo Lee
#+EMAIL: dongsoolee8@gmail.com
#+DATE: 2018-02-20

* 摘要
  :PROPERTIES: 
  :CUSTOM_ID: overview
  :LANG: zh
  :END:      

* 如何安装
  :PROPERTIES: 
  :CUSTOM_ID: how-to-install
  :LANG: zh
  :END:      

** 先决条件
   :PROPERTIES: 
   :CUSTOM_ID: prerequisites
   :LANG: zh
   :END:      

- [[./update.org][update]]
- [[./git.org][git]]

*** from Source Code

#+BEGIN_SRC sh
$ git clone https://github.com/vim/vim.git
$ cd vim/src
$ make
#+END_SRC

*** Ubuntu
#+BEGIN_SRC sh
$ apt-get install vim
#+END_SRC

** 安装
  :PROPERTIES: 
  :CUSTOM_ID: install
  :LANG: zh
  :END:      

** 安装的软件包
   :PROPERTIES: 
   :CUSTOM_ID: packages
   :LANG: zh
   :END:      

** 检查
   :PROPERTIES: 
   :CUSTOM_ID: check
   :LANG: zh
   :END:      

#+BEGIN_SRC sh
$ vim --version
#+END_SRC

#+BEGIN_EXAMPLE
Huge version without GUI.  Features included (+) or not (-):
+acl             +farsi           +mouse_netterm   +tag_binary
+arabic          +file_in_path    +mouse_sgr       +tag_old_static
+autocmd         +find_in_path    -mouse_sysmouse  -tag_any_white
-balloon_eval    +float           +mouse_urxvt     -tcl
-browse          +folding         +mouse_xterm     +terminfo
++builtin_terms  -footer          +multi_byte      +termresponse
+byte_offset     +fork()          +multi_lang      +textobjects
+channel         +gettext         -mzscheme        +timers
+cindent         -hangul_input    +netbeans_intg   +title
-clientserver    +iconv           +packages        -toolbar
-clipboard       +insert_expand   +path_extra      +user_commands
+cmdline_compl   +job             -perl            +vertsplit
+cmdline_hist    +jumplist        +persistent_undo +virtualedit
+cmdline_info    +keymap          +postscript      +visual
+comments        +langmap         +printer         +visualextra
+conceal         +libcall         +profile         +viminfo
+cryptv          +linebreak       -python          +vreplace
+cscope          +lispindent      +python3         +wildignore
+cursorbind      +listcmds        +quickfix        +wildmenu
+cursorshape     +localmap        +reltime         +windows
+dialog_con      -lua             +rightleft       +writebackup
+diff            +menu            -ruby            -X11
+digraphs        +mksession       +scrollbind      -xfontset
-dnd             +modify_fname    +signs           -xim
-ebcdic          +mouse           +smartindent     -xsmp
+emacs_tags      -mouseshape      +startuptime     -xterm_clipboard
+eval            +mouse_dec       +statusline      -xterm_save
+ex_extra        +mouse_gpm       -sun_workshop    -xpm
+extra_search    -mouse_jsbterm   +syntax
   system vimrc file: "$VIM/vimrc"
     user vimrc file: "$HOME/.vimrc"
 2nd user vimrc file: "~/.vim/vimrc"
      user exrc file: "$HOME/.exrc"
  fall-back for $VIM: "/usr/share/vim"
Compilation: gcc -c -I. -Iproto -DHAVE_CONFIG_H   -Wdate-time  -g -O2 -fPIE -fstack-protector-strong -Wformat -Werror=format-security -U_FORTIFY_SOURCE -D_FORTIFY_SOURCE=1
Linking: gcc   -Wl,-Bsymbolic-functions -fPIE -pie -Wl,-z,relro -Wl,-z,now -Wl,--as-needed -o vim        -lm -ltinfo -lnsl  -lselinux  -lacl -lattr -lgpm -ldl     -L/usr/lib/python3.5/config-3.5m-x86_64-linux-gnu -lpython3.5m -lpthread -ldl -lutil -lm
#+END_EXAMPLE

* 如何使用
  :PROPERTIES: 
  :CUSTOM_ID: usage
  :LANG: zh
  :END:      

** 结构
   :PROPERTIES: 
   :CUSTOM_ID: syntax
   :LANG: zh
   :END:      

** 组态
   :PROPERTIES: 
   :CUSTOM_ID: configuration
   :LANG: zh
   :END:      

** 选项
   :PROPERTIES: 
   :CUSTOM_ID: options
   :LANG: zh
   :END:      

** 例子
   :PROPERTIES: 
   :CUSTOM_ID: examples
   :LANG: zh
   :END:      

* 相关主题
  :PROPERTIES: 
  :CUSTOM_ID: seealso
  :LANG: zh
  :END:      

* 参考
  :PROPERTIES: 
  :CUSTOM_ID: references
  :LANG: zh
  :END:      

- [[http://www.vim.org/download.php]]
