zh/vim.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<title>vim</title>
<!-- 2018-02-25 Sun 05:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="vim - Linux命令">
<meta name="description" content="">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="vim - Linux命令">
<meta property="og:description" content="">
<meta name="twitter:title" content="vim - Linux命令">
<meta name="twitter:description" content="">
</head>
<body>
<div id="content">
<h1 class="title">vim</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#how-to-install">如何安装</a>
<ul>
<li><a href="#prerequisites">先决条件</a>
<ul>
<li><a href="#sec-1-1-1">from Source Code</a></li>
<li><a href="#sec-1-1-2">Ubuntu</a></li>
</ul>
</li>
<li><a href="#install">安装</a></li>
<li><a href="#packages">安装的软件包</a></li>
<li><a href="#check">检查</a></li>
</ul>
</li>
<li><a href="#references">参考</a></li>
</ul>
</div>
</div>

<div id="outline-container-how-to-install" class="outline-2">
<h2 id="how-to-install"><a id="sec-1" name="sec-1"></a>如何安装</h2>
<div class="outline-text-2" id="text-how-to-install">
</div>

<div id="outline-container-prerequisites" class="outline-3">
<h3 id="prerequisites"><a id="sec-1-1" name="sec-1-1"></a>先决条件</h3>
<div class="outline-text-3" id="text-prerequisites">

<ul class="org-ul">
<li><a href="./update.html">update</a>
</li>
<li><a href="./git.html">git</a>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">from Source Code</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-sh">$ git clone https://github.com/vim/vim.git
$ cd vim/src
$ make
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">Ubuntu</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">

<pre class="src src-sh">$ apt-get install vim
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-install" class="outline-3">
<h3 id="install"><a id="sec-1-2" name="sec-1-2"></a>安装</h3>
<div class="outline-text-3" id="text-install">
</div>
</div>

<div id="outline-container-packages" class="outline-3">
<h3 id="packages"><a id="sec-1-3" name="sec-1-3"></a>安装的软件包</h3>
<div class="outline-text-3" id="text-packages">
</div>
</div>

<div id="outline-container-check" class="outline-3">
<h3 id="check"><a id="sec-1-4" name="sec-1-4"></a>检查</h3>
<div class="outline-text-3" id="text-check">

<div class="org-src-container">

<pre class="src src-sh">$ vim --version
</pre>
</div>

<pre class="example">
Huge version without GUI.  Features included (+) or not (-):
+acl             +farsi           +mouse_netterm   +tag_binary
+arabic          +file_in_path    +mouse_sgr       +tag_old_static
+autocmd         +find_in_path    -mouse_sysmouse  -tag_any_white
-balloon_eval    +float           +mouse_urxvt     -tcl
-browse          +folding         +mouse_xterm     +terminfo
++builtin_terms  -footer          +multi_byte      +termresponse
+byte_offset     +fork()          +multi_lang      +textobjects
+channel         +gettext         -mzscheme        +timers
+cindent         -hangul_input    +netbeans_intg   +title
-clientserver    +iconv           +packages        -toolbar
-clipboard       +insert_expand   +path_extra      +user_commands
+cmdline_compl   +job             -perl            +vertsplit
+cmdline_hist    +jumplist        +persistent_undo +virtualedit
+cmdline_info    +keymap          +postscript      +visual
+comments        +langmap         +printer         +visualextra
+conceal         +libcall         +profile         +viminfo
+cryptv          +linebreak       -python          +vreplace
+cscope          +lispindent      +python3         +wildignore
+cursorbind      +listcmds        +quickfix        +wildmenu
+cursorshape     +localmap        +reltime         +windows
+dialog_con      -lua             +rightleft       +writebackup
+diff            +menu            -ruby            -X11
+digraphs        +mksession       +scrollbind      -xfontset
-dnd             +modify_fname    +signs           -xim
-ebcdic          +mouse           +smartindent     -xsmp
+emacs_tags      -mouseshape      +startuptime     -xterm_clipboard
+eval            +mouse_dec       +statusline      -xterm_save
+ex_extra        +mouse_gpm       -sun_workshop    -xpm
+extra_search    -mouse_jsbterm   +syntax
   system vimrc file: "$VIM/vimrc"
     user vimrc file: "$HOME/.vimrc"
 2nd user vimrc file: "~/.vim/vimrc"
      user exrc file: "$HOME/.exrc"
  fall-back for $VIM: "/usr/share/vim"
Compilation: gcc -c -I. -Iproto -DHAVE_CONFIG_H   -Wdate-time  -g -O2 -fPIE -fstack-protector-strong -Wformat -Werror=format-security -U_FORTIFY_SOURCE -D_FORTIFY_SOURCE=1
Linking: gcc   -Wl,-Bsymbolic-functions -fPIE -pie -Wl,-z,relro -Wl,-z,now -Wl,--as-needed -o vim        -lm -ltinfo -lnsl  -lselinux  -lacl -lattr -lgpm -ldl     -L/usr/lib/python3.5/config-3.5m-x86_64-linux-gnu -lpython3.5m -lpthread -ldl -lutil -lm
</pre>
</div>
</div>
</div>

<div id="outline-container-references" class="outline-2">
<h2 id="references"><a id="sec-2" name="sec-2"></a>参考</h2>
<div class="outline-text-2" id="text-references">

<ul class="org-ul">
<li><a href="http://www.vim.org/download.php">http://www.vim.org/download.php</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-20</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-25 Sun 05:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
